export const swapStatuses = {
    CONSIDERED: 0,
    ACCEPTED: 1,
    REJECTED: 2,
    READING: 3,
    RETURNED: 4
}

export const bookStatuses = {
    AVAILABLE: 0,
    READING: 1,
    NOT_AVAILABLE: 2
}


export const urls = {
    backOauth: 'http://127.0.0.1:8000/auth/login/vk-oauth2/'
}

export const genres = {
    'Русская классика': 0,
    'Зарубежная классика': 1,
    'Наука': 2,
    'IT': 3,
    'Образование': 4,
    'Современная проза': 5,
    'Приключения': 6,
    'Фэнтези': 7,
    'Ужасы': 8,
    'Детектив': 9,
    'Бизнес': 10,
    'Психология': 11,
    'Здоровье': 12,
    'Словарь': 13,
    'Поэзия и драмматургия': 14,
    'Комиксы': 15,
    'Хобби': 16,
    'Культура и искусство': 17,
    'Эротика': 18,
    'Детское': 19,
    'Религия и философия': 20,
    'Переодисекие издания': 21
}

export const genresArray = [
    'Русская классика',
    'Зарубежная классика',
    'Наука',
    'IT',
    'Образование',
    'Современная проза',
    'Приключения',
    'Фэнтези',
    'Ужасы',
    'Детектив',
    'Бизнес',
    'Психология',
    'Здоровье',
    'Словарь',
    'Поэзия и драмматургия',
    'Комиксы',
    'Хобби',
    'Культура и искусство',
    'Эротика',
    'Детское',
    'Религия и философия',
    'Переодисекие издания'
]


export const Errors = {
    404: 'https://cdn.dribbble.com/users/1322726/screenshots/5695684/dribbble-3.gif'
}