export const swapStatuses = {
    CONSIDERED: 0,
    ACCEPTED: 1,
    REJECTED: 2,
    READING: 3,
    RETURNED: 4,
    CANCELED: 5
}


export const swapResults = [
    'Обрабатывается',
    'Заявка была принята',
    'Заявка была отклонена',
    'Читается',
    'Книга возвращена',
    'Отмена запроса'
]


export const userComplainReasons = {
    'Не существует': 0,
    'Оскорбительное поведение': 1,
    'Другое':2
}

export const bookComplainReasons = {
    'Книга не существует': 0,
    'Оскорбительное содержание': 1,
    'Книга отсутствует у владельца': 2,
    'Неправильное описание': 3,
    'Другое': 4
}

export const userComplainReasonsArray = [
    'Не существует',
    'Оскорбительное поведение',
    'Другое'
]

export const bookComplainReasonsArray = [
    'Книга не существует',
    'Оскорбительное содержание',
    'Книга отсутствует у владельца',
    'Неправильное описание',
    'Другое'
]

export const bookStatuses = {
    AVAILABLE: 0,
    READING: 1,
    NOT_AVAILABLE: 2
}


export const urls = {
    backOauthVk: 'https://www.bookovsky.ru/API/auth/login/vk-oauth2/',
    backOauthGoogle: 'https://www.bookovsky.ru/API/auth/login/google-oauth2/'
}


export const genres = {
    '. . .': -1,
    'Классическая русская литература': 0,
    'Классическая зарубежная литература': 1,
    'Наука и образование': 2,
    'Бизнес-литература и саморазвитие': 3,
    'Компьютерная литература': 4,
    'Учебная литература': 5,
    'Современная проза': 6,
    'Приключения': 7,
    'Фэнтези и фантастика': 8,
    'Ужасы, мистика': 9,
    'Детективы': 10,
    'Психология': 11,
    'Красота и здоровье': 12,
    'Словари, справочники': 13,
    'Поэзия и драматургия': 14,
    'Комиксы, манга': 15,
    'Дом, семья, хобби и досуг': 16,
    'Культура и искусство': 17,
    'Эротика и секс, любовные романы': 18,
    'Детские книги': 19,
    'Философия и религия': 20,
    'Периодические издания, газеты и журналы': 21,
    'Роман': 22,
    'Научная фантастика': 23,
    'Повесть': 24
}



export const genresArray = [
    '. . .',
    'Классическая русская литература',
    'Классическая зарубежная литература',
    'Наука и образование',
    'Бизнес-литература и саморазвитие',
    'Компьютерная литература',
    'Учебная литература',
    'Современная проза',
    'Приключения',
    'Фэнтези и фантастика',
    'Ужасы, мистика',
    'Детективы',
    'Психология',
    'Красота и здоровье',
    'Словари, справочники',
    'Поэзия и драматургия',
    'Комиксы, манга',
    'Дом, семья, хобби и досуг',
    'Культура и искусство',
    'Эротика и секс, любовные романы',
    'Детские книги',
    'Философия и религия',
    'Периодические издания, газеты и журналы',
    'Роман',
    'Научная фантастика',
    'Повесть'
]


export const genresArray2 = [
    'Классическая русская литература',
    'Классическая зарубежная литература',
    'Наука и образование',
    'Бизнес-литература и саморазвитие',
    'Компьютерная литература',
    'Учебная литература',
    'Современная проза',
    'Приключения',
    'Фэнтези и фантастика',
    'Ужасы, мистика',
    'Детективы',
    'Психология',
    'Красота и здоровье',
    'Словари, справочники',
    'Поэзия и драматургия',
    'Комиксы, манга',
    'Дом, семья, хобби и досуг',
    'Культура и искусство',
    'Эротика и секс, любовные романы',
    'Детские книги',
    'Философия и религия',
    'Периодические издания, газеты и журналы',
    'Роман',
    'Научная фантастика',
    'Повесть'
]



export const Errors = {
    404: 'https://cdn.dribbble.com/users/1322726/screenshots/5695684/dribbble-3.gif'
}